arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_flash.h
// FMC Pump Access Control 1
#define FLASH_O_FPAC1                                               0x00002048

// FMC Pump Access Control 2
#define FLASH_O_FPAC2                                               0x0000204C

// FMC Module Access Control
#define FLASH_O_FMAC                                                0x00002050

// FMC Module Status
#define FLASH_O_FMSTAT                                              0x00002054

// FMC Flash Lock
#define FLASH_O_FLOCK                                               0x00002064

// FMC VREADCT Trim
#define FLASH_O_FVREADCT                                            0x00002080

// FMC VHVCT1 Trim
#define FLASH_O_FVHVCT1                                             0x00002084

// FMC VHVCT2 Trim
#define FLASH_O_FVHVCT2                                             0x00002088

// FMC VHVCT3 Trim
#define FLASH_O_FVHVCT3                                             0x0000208C

// FMC VNVCT Trim
#define FLASH_O_FVNVCT                                              0x00002090

// FMC VSL_P Trim
#define FLASH_O_FVSLP                                               0x00002094

// FMC VWLCT Trim
#define FLASH_O_FVWLCT                                              0x00002098

// FMC EFUSE Control
#define FLASH_O_FEFUSECTL                                           0x0000209C

// FMC EFUSE Status
#define FLASH_O_FEFUSESTAT                                          0x000020A0

// FMC EFUSE Data
#define FLASH_O_FEFUSEDATA                                          0x000020A4

// FMC Sequential Pump Information
#define FLASH_O_FSEQPMP                                             0x000020A8

// FMC Bank Signal Strobe
#define FLASH_O_FBSTROBES                                           0x00002100

// FMC Pump Signal Strobe
#define FLASH_O_FPSTROBES                                           0x00002104

// FMC Bank and Pump Mode
#define FLASH_O_FBMODE                                              0x00002108

// FMC Test Command Control
#define FLASH_O_FTCR                                                0x0000210C

// FMC Bank Address
#define FLASH_O_FADDR                                               0x00002110

// FMC Test Control
#define FLASH_O_FTCTL                                               0x0000211C

// FMC Flash Wide Programming Write Data 0
#define FLASH_O_FWPWRITE0                                           0x00002120

// FMC Flash Wide Programming Write Data  1
#define FLASH_O_FWPWRITE1                                           0x00002124

// FMC Flash Wide Programming Write Data  2
#define FLASH_O_FWPWRITE2                                           0x00002128

// FMC Flash Wide Programming Write Data  3
#define FLASH_O_FWPWRITE3                                           0x0000212C

// FMC Flash Wide Programming Write Data  4
#define FLASH_O_FWPWRITE4                                           0x00002130

// FMC Flash Wide Programming Write Data  5
#define FLASH_O_FWPWRITE5                                           0x00002134

// FMC Flash Wide Programming Write Data  6
#define FLASH_O_FWPWRITE6                                           0x00002138

// FMC Flash Wide Programming Write Data  7
#define FLASH_O_FWPWRITE7                                           0x0000213C

// FMC Flash Wide Programming ECC
#define FLASH_O_FWPWRITE_ECC                                        0x00002140

// FMC Software Interface Status
#define FLASH_O_FSWSTAT                                             0x00002144

// FMC FSM Global Control
#define FLASH_O_FSM_GLBCTL                                          0x00002200

// FMC FSM State Status
#define FLASH_O_FSM_STATE                                           0x00002204

// FMC FSM Status
#define FLASH_O_FSM_STAT                                            0x00002208

// FMC FSM Command
#define FLASH_O_FSM_CMD                                             0x0000220C

// FMC FSM Program/Erase Operation Setup
#define FLASH_O_FSM_PE_OSU                                          0x00002210

// FMC FSM Voltage Status Setup
#define FLASH_O_FSM_VSTAT                                           0x00002214

// FMC FSM Program/Erase Verify Setup
#define FLASH_O_FSM_PE_VSU                                          0x00002218

// FMC FSM Compare Verify Setup
#define FLASH_O_FSM_CMP_VSU                                         0x0000221C

// FMC FSM EXECUTEZ to Valid Data
#define FLASH_O_FSM_EX_VAL                                          0x00002220

// FMC FSM Read Mode Hold
#define FLASH_O_FSM_RD_H                                            0x00002224

// FMC FSM Program Hold
#define FLASH_O_FSM_P_OH                                            0x00002228

// FMC FSM Erase Operation Hold
#define FLASH_O_FSM_ERA_OH                                          0x0000222C

// FMC FSM Saved Program Pulses
#define FLASH_O_FSM_SAV_PPUL                                        0x00002230

// FMC FSM Program/Erase Verify Hold
#define FLASH_O_FSM_PE_VH                                           0x00002234

// FMC FSM Program Pulse Width
#define FLASH_O_FSM_PRG_PW                                          0x00002240

// FMC FSM Erase Pulse Width
#define FLASH_O_FSM_ERA_PW                                          0x00002244

// FMC FSM Saved Erased Pulses
#define FLASH_O_FSM_SAV_ERA_PUL                                     0x00002254

// FMC FSM Timer
#define FLASH_O_FSM_TIMER                                           0x00002258

// FMC FSM MODE
#define FLASH_O_FSM_MODE                                            0x0000225C

// FMC FSM Program Bits
#define FLASH_O_FSM_PGM                                             0x00002260

// FMC FSM Erase Bits
#define FLASH_O_FSM_ERA                                             0x00002264

// FMC FSM Maximum Programming Pulses
#define FLASH_O_FSM_PRG_PUL                                         0x00002268

// FMC FSM Maximum Erase Pulses
#define FLASH_O_FSM_ERA_PUL                                         0x0000226C

// FMC FSM EC Step Size
#define FLASH_O_FSM_STEP_SIZE                                       0x00002270

