arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_flash.h
// FMC FSM Pulse Counter
#define FLASH_O_FSM_PUL_CNTR                                        0x00002274

// FMC FSM EC Step Height
#define FLASH_O_FSM_EC_STEP_HEIGHT                                  0x00002278

// FMC FSM_ST_MACHINE
#define FLASH_O_FSM_ST_MACHINE                                      0x0000227C

// FMC FLES Memory Control Bits
#define FLASH_O_FSM_FLES                                            0x00002280

// FMC FSM Register Write Enable
#define FLASH_O_FSM_WR_ENA                                          0x00002288

// FMC FSM Accumulate Program Pulses
#define FLASH_O_FSM_ACC_PP                                          0x0000228C

// FMC FSM Accumulate Erase Pulses
#define FLASH_O_FSM_ACC_EP                                          0x00002290

// FMC FSM Address
#define FLASH_O_FSM_ADDR                                            0x000022A0

// FMC Sectors Erased
#define FLASH_O_FSM_SECTOR                                          0x000022A4

// FMC Revision Identification
#define FLASH_O_FMC_REV_ID                                          0x000022A8

// FSM Error Address
#define FLASH_O_FSM_ERR_ADDR                                        0x000022AC

// FMC FSM Maximum Program Pulse
#define FLASH_O_FSM_PGM_MAXPUL                                      0x000022B0

// FMC FSM Command Execute
#define FLASH_O_FSM_EXECUTE                                         0x000022B4

// FMC FSM Sector Erased 1
#define FLASH_O_FSM_SECTOR1                                         0x000022C0

// FMC FSM Sector Erased  2
#define FLASH_O_FSM_SECTOR2                                         0x000022C4

// FMC FSM Bank Sector Lock Erase 0
#define FLASH_O_FSM_BSLE0                                           0x000022E0

// FMC FSM Bank Sector Lock Erase 1
#define FLASH_O_FSM_BSLE1                                           0x000022E4

// FMC FSM Bank Sector Lock Program 0
#define FLASH_O_FSM_BSLP0                                           0x000022F0

// FMC FSM Bank Sector Lock Program 1
#define FLASH_O_FSM_BSLP1                                           0x000022F4

// FMC Flash Configuration Bank
#define FLASH_O_FCFG_BANK                                           0x00002400

// FMC Flash Wrapper Configuration
#define FLASH_O_FCFG_WRAPPER                                        0x00002404

// FMC Flash Bank Type
#define FLASH_O_FCFG_BNK_TYPE                                       0x00002408

// FMC Flash Bank 0 Starting Address
#define FLASH_O_FCFG_B0_START                                       0x00002410

// FMC Flash Bank 1 Starting Address
#define FLASH_O_FCFG_B1_START                                       0x00002414

// FMC Flash Bank 2 Starting Address
#define FLASH_O_FCFG_B2_START                                       0x00002418

// FMC Flash Bank 3 Starting Address
#define FLASH_O_FCFG_B3_START                                       0x0000241C

// FMC Flash Bank 4 Starting Address
#define FLASH_O_FCFG_B4_START                                       0x00002420

// FMC Flash Bank 5 Starting Address
#define FLASH_O_FCFG_B5_START                                       0x00002424

// FMC Flash Bank 6 Starting Address
#define FLASH_O_FCFG_B6_START                                       0x00002428

// FMC Flash Bank 7 Starting Address
#define FLASH_O_FCFG_B7_START                                       0x0000242C

// FMC Flash Bank 0 Sector Size 0
#define FLASH_O_FCFG_B0_SSIZE0                                      0x00002430

//*****************************************************************************
//
// Register: FLASH_O_STAT
//
//*****************************************************************************
// Field:    [15] EFUSE_BLANK
//
// Efuse scanning detected if fuse ROM is blank:
// 0 : Not blank
// 1 : Blank
#define FLASH_STAT_EFUSE_BLANK                                      0x00008000
#define FLASH_STAT_EFUSE_BLANK_BITN                                         15
#define FLASH_STAT_EFUSE_BLANK_M                                    0x00008000
#define FLASH_STAT_EFUSE_BLANK_S                                            15

// Field:    [14] EFUSE_TIMEOUT
//
// Efuse scanning resulted in timeout error.
// 0 : No Timeout error
// 1 : Timeout Error
#define FLASH_STAT_EFUSE_TIMEOUT                                    0x00004000
#define FLASH_STAT_EFUSE_TIMEOUT_BITN                                       14
#define FLASH_STAT_EFUSE_TIMEOUT_M                                  0x00004000
#define FLASH_STAT_EFUSE_TIMEOUT_S                                          14

// Field:    [13] EFUSE_CRC_ERROR
//
// Efuse scanning resulted in scan chain CRC error.
// 0 : No CRC error
// 1 : CRC Error
#define FLASH_STAT_EFUSE_CRC_ERROR                                  0x00002000
#define FLASH_STAT_EFUSE_CRC_ERROR_BITN                                     13
#define FLASH_STAT_EFUSE_CRC_ERROR_M                                0x00002000
#define FLASH_STAT_EFUSE_CRC_ERROR_S                                        13

// Field:  [12:8] EFUSE_ERRCODE
//
// Same as EFUSEERROR.CODE
#define FLASH_STAT_EFUSE_ERRCODE_M                                  0x00001F00
#define FLASH_STAT_EFUSE_ERRCODE_S                                           8

// Field:     [2] SAMHOLD_DIS
//
// Status indicator of flash sample and hold sequencing logic. This bit will go
// to 1 some delay after CFG.DIS_IDLE is set to 1.
// 0: Not disabled
// 1: Sample and hold disabled and stable
#define FLASH_STAT_SAMHOLD_DIS                                      0x00000004
#define FLASH_STAT_SAMHOLD_DIS_BITN                                          2
#define FLASH_STAT_SAMHOLD_DIS_M                                    0x00000004
#define FLASH_STAT_SAMHOLD_DIS_S                                             2

// Field:     [1] BUSY
//
// Fast version of the FMC FMSTAT.BUSY bit.
// This flag is valid immediately after the operation setting it (FMSTAT.BUSY
// is delayed some cycles)
// 0 : Not busy
// 1 : Busy
#define FLASH_STAT_BUSY                                             0x00000002
#define FLASH_STAT_BUSY_BITN                                                 1
#define FLASH_STAT_BUSY_M                                           0x00000002
#define FLASH_STAT_BUSY_S                                                    1

