arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_flash.h
// Field:     [9] CV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_CV                                             0x00000200
#define FLASH_FMSTAT_CV_BITN                                                 9
#define FLASH_FMSTAT_CV_M                                           0x00000200
#define FLASH_FMSTAT_CV_S                                                    9

// Field:     [8] BUSY
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_BUSY                                           0x00000100
#define FLASH_FMSTAT_BUSY_BITN                                               8
#define FLASH_FMSTAT_BUSY_M                                         0x00000100
#define FLASH_FMSTAT_BUSY_S                                                  8

// Field:     [7] ERS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_ERS                                            0x00000080
#define FLASH_FMSTAT_ERS_BITN                                                7
#define FLASH_FMSTAT_ERS_M                                          0x00000080
#define FLASH_FMSTAT_ERS_S                                                   7

// Field:     [6] PGM
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_PGM                                            0x00000040
#define FLASH_FMSTAT_PGM_BITN                                                6
#define FLASH_FMSTAT_PGM_M                                          0x00000040
#define FLASH_FMSTAT_PGM_S                                                   6

// Field:     [5] INVDAT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_INVDAT                                         0x00000020
#define FLASH_FMSTAT_INVDAT_BITN                                             5
#define FLASH_FMSTAT_INVDAT_M                                       0x00000020
#define FLASH_FMSTAT_INVDAT_S                                                5

// Field:     [4] CSTAT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_CSTAT                                          0x00000010
#define FLASH_FMSTAT_CSTAT_BITN                                              4
#define FLASH_FMSTAT_CSTAT_M                                        0x00000010
#define FLASH_FMSTAT_CSTAT_S                                                 4

// Field:     [3] VOLSTAT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_VOLSTAT                                        0x00000008
#define FLASH_FMSTAT_VOLSTAT_BITN                                            3
#define FLASH_FMSTAT_VOLSTAT_M                                      0x00000008
#define FLASH_FMSTAT_VOLSTAT_S                                               3

// Field:     [2] ESUSP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_ESUSP                                          0x00000004
#define FLASH_FMSTAT_ESUSP_BITN                                              2
#define FLASH_FMSTAT_ESUSP_M                                        0x00000004
#define FLASH_FMSTAT_ESUSP_S                                                 2

// Field:     [1] PSUSP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_PSUSP                                          0x00000002
#define FLASH_FMSTAT_PSUSP_BITN                                              1
#define FLASH_FMSTAT_PSUSP_M                                        0x00000002
#define FLASH_FMSTAT_PSUSP_S                                                 1

// Field:     [0] SLOCK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_SLOCK                                          0x00000001
#define FLASH_FMSTAT_SLOCK_BITN                                              0
#define FLASH_FMSTAT_SLOCK_M                                        0x00000001
#define FLASH_FMSTAT_SLOCK_S                                                 0

//*****************************************************************************
//
// Register: FLASH_O_FLOCK
//
//*****************************************************************************
// Field:  [15:0] ENCOM
//
// Internal. Only to be used through TI provided API.
#define FLASH_FLOCK_ENCOM_M                                         0x0000FFFF
#define FLASH_FLOCK_ENCOM_S                                                  0

//*****************************************************************************
//
// Register: FLASH_O_FVREADCT
//
//*****************************************************************************
// Field:   [3:0] VREADCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVREADCT_VREADCT_M                                    0x0000000F
#define FLASH_FVREADCT_VREADCT_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FVHVCT1
//
//*****************************************************************************
// Field: [23:20] TRIM13_E
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT1_TRIM13_E_M                                    0x00F00000
#define FLASH_FVHVCT1_TRIM13_E_S                                            20

// Field: [19:16] VHVCT_E
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT1_VHVCT_E_M                                     0x000F0000
#define FLASH_FVHVCT1_VHVCT_E_S                                             16

// Field:   [7:4] TRIM13_PV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT1_TRIM13_PV_M                                   0x000000F0
#define FLASH_FVHVCT1_TRIM13_PV_S                                            4

// Field:   [3:0] VHVCT_PV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT1_VHVCT_PV_M                                    0x0000000F
#define FLASH_FVHVCT1_VHVCT_PV_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FVHVCT2
//
//*****************************************************************************
// Field: [23:20] TRIM13_P
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT2_TRIM13_P_M                                    0x00F00000
#define FLASH_FVHVCT2_TRIM13_P_S                                            20

// Field: [19:16] VHVCT_P
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT2_VHVCT_P_M                                     0x000F0000
#define FLASH_FVHVCT2_VHVCT_P_S                                             16

//*****************************************************************************
//
// Register: FLASH_O_FVHVCT3
//
//*****************************************************************************
// Field: [19:16] WCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT3_WCT_M                                         0x000F0000
#define FLASH_FVHVCT3_WCT_S                                                 16

// Field:   [3:0] VHVCT_READ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVHVCT3_VHVCT_READ_M                                  0x0000000F
#define FLASH_FVHVCT3_VHVCT_READ_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FVNVCT
//
//*****************************************************************************
// Field:  [12:8] VCG2P5CT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVNVCT_VCG2P5CT_M                                     0x00001F00
#define FLASH_FVNVCT_VCG2P5CT_S                                              8

// Field:   [4:0] VIN_CT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVNVCT_VIN_CT_M                                       0x0000001F
#define FLASH_FVNVCT_VIN_CT_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_FVSLP
//
//*****************************************************************************
// Field: [15:12] VSL_P
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVSLP_VSL_P_M                                         0x0000F000
#define FLASH_FVSLP_VSL_P_S                                                 12

//*****************************************************************************
//
// Register: FLASH_O_FVWLCT
//
//*****************************************************************************
// Field:   [4:0] VWLCT_P
//
// Internal. Only to be used through TI provided API.
#define FLASH_FVWLCT_VWLCT_P_M                                      0x0000001F
#define FLASH_FVWLCT_VWLCT_P_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_FEFUSECTL
//
//*****************************************************************************
// Field: [26:24] CHAIN_SEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSECTL_CHAIN_SEL_M                                 0x07000000
#define FLASH_FEFUSECTL_CHAIN_SEL_S                                         24

// Field:    [17] WRITE_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSECTL_WRITE_EN                                    0x00020000
#define FLASH_FEFUSECTL_WRITE_EN_BITN                                       17
#define FLASH_FEFUSECTL_WRITE_EN_M                                  0x00020000
#define FLASH_FEFUSECTL_WRITE_EN_S                                          17

