arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_flash.h
// Field:  [15:8] ECCBYTES23_16
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_M                          0x0000FF00
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_S                                   8

// Field:   [7:0] ECCBYTES31_24
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_M                          0x000000FF
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_FSWSTAT
//
//*****************************************************************************
// Field:     [0] SAFELV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSWSTAT_SAFELV                                        0x00000001
#define FLASH_FSWSTAT_SAFELV_BITN                                            0
#define FLASH_FSWSTAT_SAFELV_M                                      0x00000001
#define FLASH_FSWSTAT_SAFELV_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_FSM_GLBCTL
//
//*****************************************************************************
// Field:     [0] CLKSEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_GLBCTL_CLKSEL                                     0x00000001
#define FLASH_FSM_GLBCTL_CLKSEL_BITN                                         0
#define FLASH_FSM_GLBCTL_CLKSEL_M                                   0x00000001
#define FLASH_FSM_GLBCTL_CLKSEL_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_STATE
//
//*****************************************************************************
// Field:    [11] CTRLENZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_CTRLENZ                                     0x00000800
#define FLASH_FSM_STATE_CTRLENZ_BITN                                        11
#define FLASH_FSM_STATE_CTRLENZ_M                                   0x00000800
#define FLASH_FSM_STATE_CTRLENZ_S                                           11

// Field:    [10] EXECUTEZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_EXECUTEZ                                    0x00000400
#define FLASH_FSM_STATE_EXECUTEZ_BITN                                       10
#define FLASH_FSM_STATE_EXECUTEZ_M                                  0x00000400
#define FLASH_FSM_STATE_EXECUTEZ_S                                          10

// Field:     [8] FSM_ACT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_FSM_ACT                                     0x00000100
#define FLASH_FSM_STATE_FSM_ACT_BITN                                         8
#define FLASH_FSM_STATE_FSM_ACT_M                                   0x00000100
#define FLASH_FSM_STATE_FSM_ACT_S                                            8

// Field:     [7] TIOTP_ACT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_TIOTP_ACT                                   0x00000080
#define FLASH_FSM_STATE_TIOTP_ACT_BITN                                       7
#define FLASH_FSM_STATE_TIOTP_ACT_M                                 0x00000080
#define FLASH_FSM_STATE_TIOTP_ACT_S                                          7

// Field:     [6] OTP_ACT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_OTP_ACT                                     0x00000040
#define FLASH_FSM_STATE_OTP_ACT_BITN                                         6
#define FLASH_FSM_STATE_OTP_ACT_M                                   0x00000040
#define FLASH_FSM_STATE_OTP_ACT_S                                            6

//*****************************************************************************
//
// Register: FLASH_O_FSM_STAT
//
//*****************************************************************************
// Field:     [2] NON_OP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STAT_NON_OP                                       0x00000004
#define FLASH_FSM_STAT_NON_OP_BITN                                           2
#define FLASH_FSM_STAT_NON_OP_M                                     0x00000004
#define FLASH_FSM_STAT_NON_OP_S                                              2

// Field:     [1] OVR_PUL_CNT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STAT_OVR_PUL_CNT                                  0x00000002
#define FLASH_FSM_STAT_OVR_PUL_CNT_BITN                                      1
#define FLASH_FSM_STAT_OVR_PUL_CNT_M                                0x00000002
#define FLASH_FSM_STAT_OVR_PUL_CNT_S                                         1

// Field:     [0] INV_DAT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STAT_INV_DAT                                      0x00000001
#define FLASH_FSM_STAT_INV_DAT_BITN                                          0
#define FLASH_FSM_STAT_INV_DAT_M                                    0x00000001
#define FLASH_FSM_STAT_INV_DAT_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_CMD
//
//*****************************************************************************
// Field:   [5:0] FSMCMD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_CMD_FSMCMD_M                                      0x0000003F
#define FLASH_FSM_CMD_FSMCMD_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_OSU
//
//*****************************************************************************
// Field:  [15:8] PGM_OSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_OSU_PGM_OSU_M                                  0x0000FF00
#define FLASH_FSM_PE_OSU_PGM_OSU_S                                           8

// Field:   [7:0] ERA_OSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_OSU_ERA_OSU_M                                  0x000000FF
#define FLASH_FSM_PE_OSU_ERA_OSU_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FSM_VSTAT
//
//*****************************************************************************
// Field: [15:12] VSTAT_CNT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_VSTAT_VSTAT_CNT_M                                 0x0000F000
#define FLASH_FSM_VSTAT_VSTAT_CNT_S                                         12

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_VSU
//
//*****************************************************************************
// Field:  [15:8] PGM_VSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_VSU_PGM_VSU_M                                  0x0000FF00
#define FLASH_FSM_PE_VSU_PGM_VSU_S                                           8

