arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_flash.h
// Field:   [7:0] ERA_VSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_VSU_ERA_VSU_M                                  0x000000FF
#define FLASH_FSM_PE_VSU_ERA_VSU_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FSM_CMP_VSU
//
//*****************************************************************************
// Field: [15:12] ADD_EXZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_CMP_VSU_ADD_EXZ_M                                 0x0000F000
#define FLASH_FSM_CMP_VSU_ADD_EXZ_S                                         12

//*****************************************************************************
//
// Register: FLASH_O_FSM_EX_VAL
//
//*****************************************************************************
// Field:  [15:8] REP_VSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EX_VAL_REP_VSU_M                                  0x0000FF00
#define FLASH_FSM_EX_VAL_REP_VSU_S                                           8

// Field:   [7:0] EXE_VALD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EX_VAL_EXE_VALD_M                                 0x000000FF
#define FLASH_FSM_EX_VAL_EXE_VALD_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FSM_RD_H
//
//*****************************************************************************
// Field:   [7:0] RD_H
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_RD_H_RD_H_M                                       0x000000FF
#define FLASH_FSM_RD_H_RD_H_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_FSM_P_OH
//
//*****************************************************************************
// Field:  [15:8] PGM_OH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_P_OH_PGM_OH_M                                     0x0000FF00
#define FLASH_FSM_P_OH_PGM_OH_S                                              8

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_OH
//
//*****************************************************************************
// Field:  [15:0] ERA_OH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_OH_ERA_OH_M                                   0x0000FFFF
#define FLASH_FSM_ERA_OH_ERA_OH_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SAV_PPUL
//
//*****************************************************************************
// Field:  [11:0] SAV_P_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SAV_PPUL_SAV_P_PUL_M                              0x00000FFF
#define FLASH_FSM_SAV_PPUL_SAV_P_PUL_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_VH
//
//*****************************************************************************
// Field:  [15:8] PGM_VH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_VH_PGM_VH_M                                    0x0000FF00
#define FLASH_FSM_PE_VH_PGM_VH_S                                             8

//*****************************************************************************
//
// Register: FLASH_O_FSM_PRG_PW
//
//*****************************************************************************
// Field:  [15:0] PROG_PUL_WIDTH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PRG_PW_PROG_PUL_WIDTH_M                           0x0000FFFF
#define FLASH_FSM_PRG_PW_PROG_PUL_WIDTH_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_PW
//
//*****************************************************************************
// Field:  [31:0] FSM_ERA_PW
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_PW_FSM_ERA_PW_M                               0xFFFFFFFF
#define FLASH_FSM_ERA_PW_FSM_ERA_PW_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SAV_ERA_PUL
//
//*****************************************************************************
// Field:  [11:0] SAV_ERA_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SAV_ERA_PUL_SAV_ERA_PUL_M                         0x00000FFF
#define FLASH_FSM_SAV_ERA_PUL_SAV_ERA_PUL_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FSM_TIMER
//
//*****************************************************************************
// Field:  [31:0] FSM_TIMER
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_TIMER_FSM_TIMER_M                                 0xFFFFFFFF
#define FLASH_FSM_TIMER_FSM_TIMER_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FSM_MODE
//
//*****************************************************************************
// Field: [19:18] RDV_SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_RDV_SUBMODE_M                                0x000C0000
#define FLASH_FSM_MODE_RDV_SUBMODE_S                                        18

// Field: [17:16] PGM_SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_PGM_SUBMODE_M                                0x00030000
#define FLASH_FSM_MODE_PGM_SUBMODE_S                                        16

// Field: [15:14] ERA_SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_ERA_SUBMODE_M                                0x0000C000
#define FLASH_FSM_MODE_ERA_SUBMODE_S                                        14

// Field: [13:12] SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_SUBMODE_M                                    0x00003000
#define FLASH_FSM_MODE_SUBMODE_S                                            12

// Field:  [11:9] SAV_PGM_CMD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_SAV_PGM_CMD_M                                0x00000E00
#define FLASH_FSM_MODE_SAV_PGM_CMD_S                                         9

// Field:   [8:6] SAV_ERA_MODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_SAV_ERA_MODE_M                               0x000001C0
#define FLASH_FSM_MODE_SAV_ERA_MODE_S                                        6

// Field:   [5:3] MODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_MODE_M                                       0x00000038
#define FLASH_FSM_MODE_MODE_S                                                3

// Field:   [2:0] CMD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_CMD_M                                        0x00000007
#define FLASH_FSM_MODE_CMD_S                                                 0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PGM
//
//*****************************************************************************
// Field: [25:23] PGM_BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PGM_PGM_BANK_M                                    0x03800000
#define FLASH_FSM_PGM_PGM_BANK_S                                            23

// Field:  [22:0] PGM_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PGM_PGM_ADDR_M                                    0x007FFFFF
#define FLASH_FSM_PGM_PGM_ADDR_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA
//
//*****************************************************************************
// Field: [25:23] ERA_BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_ERA_BANK_M                                    0x03800000
#define FLASH_FSM_ERA_ERA_BANK_S                                            23

