arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_flash.h
// Field:  [22:0] ERA_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_ERA_ADDR_M                                    0x007FFFFF
#define FLASH_FSM_ERA_ERA_ADDR_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PRG_PUL
//
//*****************************************************************************
// Field: [19:16] BEG_EC_LEVEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PRG_PUL_BEG_EC_LEVEL_M                            0x000F0000
#define FLASH_FSM_PRG_PUL_BEG_EC_LEVEL_S                                    16

// Field:  [11:0] MAX_PRG_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PRG_PUL_MAX_PRG_PUL_M                             0x00000FFF
#define FLASH_FSM_PRG_PUL_MAX_PRG_PUL_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_PUL
//
//*****************************************************************************
// Field: [19:16] MAX_EC_LEVEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_PUL_MAX_EC_LEVEL_M                            0x000F0000
#define FLASH_FSM_ERA_PUL_MAX_EC_LEVEL_S                                    16

// Field:  [11:0] MAX_ERA_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_PUL_MAX_ERA_PUL_M                             0x00000FFF
#define FLASH_FSM_ERA_PUL_MAX_ERA_PUL_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_STEP_SIZE
//
//*****************************************************************************
// Field: [24:16] EC_STEP_SIZE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STEP_SIZE_EC_STEP_SIZE_M                          0x01FF0000
#define FLASH_FSM_STEP_SIZE_EC_STEP_SIZE_S                                  16

//*****************************************************************************
//
// Register: FLASH_O_FSM_PUL_CNTR
//
//*****************************************************************************
// Field: [24:16] CUR_EC_LEVEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PUL_CNTR_CUR_EC_LEVEL_M                           0x01FF0000
#define FLASH_FSM_PUL_CNTR_CUR_EC_LEVEL_S                                   16

// Field:  [11:0] PUL_CNTR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PUL_CNTR_PUL_CNTR_M                               0x00000FFF
#define FLASH_FSM_PUL_CNTR_PUL_CNTR_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FSM_EC_STEP_HEIGHT
//
//*****************************************************************************
// Field:   [3:0] EC_STEP_HEIGHT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EC_STEP_HEIGHT_EC_STEP_HEIGHT_M                   0x0000000F
#define FLASH_FSM_EC_STEP_HEIGHT_EC_STEP_HEIGHT_S                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ST_MACHINE
//
//*****************************************************************************
// Field:    [23] DO_PRECOND
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_DO_PRECOND                             0x00800000
#define FLASH_FSM_ST_MACHINE_DO_PRECOND_BITN                                23
#define FLASH_FSM_ST_MACHINE_DO_PRECOND_M                           0x00800000
#define FLASH_FSM_ST_MACHINE_DO_PRECOND_S                                   23

// Field:    [22] FSM_INT_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN                             0x00400000
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN_BITN                                22
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN_M                           0x00400000
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN_S                                   22

// Field:    [21] ALL_BANKS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_ALL_BANKS                              0x00200000
#define FLASH_FSM_ST_MACHINE_ALL_BANKS_BITN                                 21
#define FLASH_FSM_ST_MACHINE_ALL_BANKS_M                            0x00200000
#define FLASH_FSM_ST_MACHINE_ALL_BANKS_S                                    21

// Field:    [20] CMPV_ALLOWED
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED                           0x00100000
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED_BITN                              20
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED_M                         0x00100000
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED_S                                 20

// Field:    [19] RANDOM
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RANDOM                                 0x00080000
#define FLASH_FSM_ST_MACHINE_RANDOM_BITN                                    19
#define FLASH_FSM_ST_MACHINE_RANDOM_M                               0x00080000
#define FLASH_FSM_ST_MACHINE_RANDOM_S                                       19

// Field:    [18] RV_SEC_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN                              0x00040000
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN_BITN                                 18
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN_M                            0x00040000
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN_S                                    18

// Field:    [17] RV_RES
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RV_RES                                 0x00020000
#define FLASH_FSM_ST_MACHINE_RV_RES_BITN                                    17
#define FLASH_FSM_ST_MACHINE_RV_RES_M                               0x00020000
#define FLASH_FSM_ST_MACHINE_RV_RES_S                                       17

// Field:    [16] RV_INT_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RV_INT_EN                              0x00010000
#define FLASH_FSM_ST_MACHINE_RV_INT_EN_BITN                                 16
#define FLASH_FSM_ST_MACHINE_RV_INT_EN_M                            0x00010000
#define FLASH_FSM_ST_MACHINE_RV_INT_EN_S                                    16

// Field:    [14] ONE_TIME_GOOD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD                          0x00004000
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_BITN                             14
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_M                        0x00004000
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_S                                14

// Field:    [11] DO_REDU_COL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL                            0x00000800
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_BITN                               11
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_M                          0x00000800
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_S                                  11

// Field:  [10:7] DBG_SHORT_ROW
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_DBG_SHORT_ROW_M                        0x00000780
#define FLASH_FSM_ST_MACHINE_DBG_SHORT_ROW_S                                 7

// Field:     [5] PGM_SEC_COF_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN                         0x00000020
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_BITN                             5
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_M                       0x00000020
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_S                                5

// Field:     [4] PREC_STOP_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN                           0x00000010
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_BITN                               4
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_M                         0x00000010
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_S                                  4

